{"pages":[{"title":"文章分類","text":"","link":"/categories/index.html"},{"title":"標籤","text":"","link":"/tags/index.html"}],"posts":[{"title":"對於 Google BERT 演算法的感想","text":"前一篇文章提到透過不同方式而來的讀者，大致上可能會有什麼樣的特性。這篇，想來分享一下 Google 最新的演算法。這一個月來，看到好幾篇文章都有寫到部落格流量突然掉下來。明明寫文章的風格和頻率都和以前一樣，怎麼忽然流量變得很低。其中有個因素是 Google 更改了演算法的規則。(這部分 Facebook、Instagram 的小編們應該也有相同的困擾，因為這兩家社群平台也在更動他們的演算法…)。 不要讓 Google 搜尋太累每次在看這種文章和分享時，都會覺得大家好像都是 Google 演算法的員工一樣，只要網站、部落格乖乖跟著 Google 的規則走，不要加重 Google 搜尋的負擔，讓他需要額外做很多工作篩選資料，你的文章就比較容易排上自然搜尋的較高名次。 從這個面向來看，我們就需要思考： Google 搜尋的目的到底是什麼？非常簡單，只要我們從「Google 使用者」的角度去思考就好了。身為使用者，我們為什麼會用 Google，而不是其他家網路公司呢？當然是因為 Google 搜尋比較有效率啊，再奇怪的關鍵字他都有辦法找出來（這是真的，我常幹這種事情）。 由此可見，「資訊提供的精準度」對於 Google 而言是非常重要的事情。如果我們以 Google 的角度思考，我們一定不希望自己提供給顧客的資訊是亂七八糟，沒有重點，而且過於龐雜的資訊吧。這樣的精準度，除了「透過搜尋者使用的關鍵字，投遞相關性最高的資訊」，這樣比較直覺性的做法，Google 去年底發展出一套很有趣的演算法：BERT。 BERT : 提升對話式查詢BERT 聽起來好像很難理解，但是講白話就是，因為常常搜尋者可能不太清楚自己想要找什麼，所以會像是在跟朋友徵詢意見一樣，把整句話打到 Google 搜尋裡。像是：下班晚餐吃什麼、去日本要注意些什麼、武漢肺炎很可怕嗎？ 以前如果同學打這種關鍵字，我還會嘲笑他，結果現在 Google 竟然辦到了！ 現在這種演算法剛起步，所以成效可能還是沒有精準的關鍵字好，但未來肯定會有更大的影響力。 對於部落格、網站會有什麼影響以前的關鍵字是非常機械性的字眼，像是「台中 好吃 晚餐」，許多部落格、網站在標題的命名上，為了提升 Google 搜尋的排名，也會採用這樣的命名方式。可是，因為 Google 發展出這樣的搜尋方式，所以上述的關鍵字標題，在搜尋的排行上，勢必就會因此受到影響。就 Google 的核心目的而言，他們就是為了提升搜尋品質更趨近於人性的需求。因此，網站與部落格的資訊一定是越接近這個目的越好。 不過，或許也不需要太擔心。因為 Google 的目的始終是希望資訊越符合人性，並且提供有用的資訊；那麼我們也只要從自身的需求、對身邊的人的觀察去做發想，我想基本上就可以符合 Google 搜尋引擎的需求了。 之所以會有 BERT 這樣的搜尋演算法，其實就是因為人們常是不知道自己的需求究竟是什麼。大多數的人常常是：好無聊喔，我想看看有什麼東西，可是我不知道我想要什麼。人們帶著模模糊糊的印象，打開搜尋引擎，希望搜尋引擎可以給他們一些靈感。所以，對於網站、部落格，我想或許就不能假定訪客都是知道自己想要什麼的人，就跟我們日常生活中見到的多數人一樣（包括我也是），大家都是不知道自己想要什麼，但是又想要自己的期待得到滿足的人。就像是求神問卜一樣。因此，身為網站、部落格的經營者，我們除了提供確切的資訊以外，還要知道怎麼說出讀者不知道怎麼描述的需求吧！ 參考資料：iThome: Google用BERT改善自家搜尋品質","link":"/2020/03/03/BERT_blogger%E8%A7%80%E9%BB%9E/"},{"title":"vue cli中使用bootstrap的JS元件","text":"一般來說，如果要在 Vue cli 中使用 bootstrap 的 modal （或是其他 JS 元件），只要在 Vue cli 中的進入點，main.js 這支檔案中，匯入 bootstrap 即可。在這個部分，Vue cli 可能會提醒你要安裝 jquery 和 popper.js 兩支檔案，因為 bootstrap 的 JS 元件就是用這兩個函式庫寫成的。這時候，只要跟著 npm 的指令做就可以了。 安裝了 jqeury，也把 bootstrap 匯入 Vue 專案中後，我們就可以把 modal 這個元件寫到 Vue 元件的 template 部分裡，不需要額外寫其他程式碼，這個 modal 就會運行了。這部分和我們一般在寫 bootstrap 時一樣。 兩種使用 bootstrap 的 JS 元件方法，以 modal 為例在 bootstrap 的 modal 使用說明中，該篇文章的結語部分，提到「有兩種使用 modal 的方法」： 透過 data-* 屬性 ( 把 bootstrap 提供的 HTML 貼到自己的 HTML 檔裡 ) 透過 JavaScript ( 部分自己寫 JS 程式碼、部分使用 bootstrap 寫好的程式碼 ) 透過 data-* 屬性透過 data-* 屬性是一般使用 modal 的方法。透過 bootstrap 提供的 HTML 程式碼在網頁中使用 modal 這個元件 。這段程式碼裡，包含了 data-toggle 和 data-target 兩個屬性，我們便是透過這兩個屬性讓 bootstrap 的 JS 程式碼去選取 我們網頁的 DOM 元素。bootstrap 透過 data-toggle 選取相對應的事件觸發元素（例如，button），再透過 data-target 選取 modal 本身（那個跳出來的 div）。 我們可以想像在 bootstrap 的 JS 程式碼中，可能是這樣： /* 這不是 bootstrap 的程式碼，是我猜測 bootstrap 可能會這樣寫：*/ const button = // 用 jquery 的方式選取有 data-toggle 的 DOM 元素 // const target = // data-target的值 // const modal = // 用 target 選取 DOM 元素，也就是 modal 本身 // button.addEventListener(&apos;click&apos;, toggleDOM(modal)); function toggleDOM(modal){ // button被觸發後，modal的行為 }自己選取 DOM 元素，但是使用 bootstrap 的 JS 程式碼。jquery 的寫法、一些基本概念由於 bootstrap 是使用 jquery 去撰寫 JS 元件的程式碼，所以在這部分我們一樣也是使用 jquery 的方法選取 DOM 元素。在一組 modal 中，我們需要兩個 DOM 元素： 觸發的按鈕 modal 本身 因此，我們只要透過 jquery 的方式，選取這兩個 DOM 元素即可。 $(&apos;button&apos;).click(function(){ $(&apos;#myModal&apos;).modal(options); //這行是 bootstrap 提供的程式碼 })在這邊我們會發現，不管是透過第一種 data的方法，還是 $(‘’) 這個方法，最主要的差別只是用不同的方式選取 DOM 元素。因為，我們已經用 $(‘’) 代替了 data-toggle 和 data-target 。所以，當我們使用第二種 $(‘’) 的方法時，我們就必須把 HTML 的程式碼中，data-* 的屬性拿掉。 在 Vue cli 的元件中…概念上和 上述 jquery 的寫法差不多，就是用 Vue.js 的語法寫按鈕事件，只是在 methods 的部分，我們使用 jqeury 的方式選取 DOM，event handler 用的是 bootstrap 寫好的方法： &lt;button @click=&quot;callModal&quot;&gt; //... 中間很多程式碼 ...// methods: { callModal() { $(&apos;#myModal&apos;).modal(&apos;options&apos;); } }在這邊，如果使用了 ESlint 的話，可能會跳出錯誤訊息。這是因為，在這個元件中，我們並沒有定義 $ 是什麼。如果要解決這個方法，我們就需要把 $ 這個變數匯入元件當中： import $ form &apos;jquery&apos;為什麼要用第二種方法？透過第二種方法，我們就可以進一步使用其他方式決定 modal 跳出的時間，優化使用者體驗。例如，在第二種方法中，我們可以用 ajax 的方式，讓呼叫 modal 的按鈕在被觸發後，稍作等待，等待 ajax 取得資料後，再讓相對應的 modal 跳出。這樣做的用意，是為了確保 modal 有資料後，才會呈現給使用者。 **關於在Vue cli 中使用 jquery 這篇文章有更詳細的說明： https://pjchender.github.io/2017/09/26/vue-在-vue-中使用（es6-import）-bootstrap4-和-jquery/","link":"/2020/03/07/vue-cli%E4%B8%AD%E4%BD%BF%E7%94%A8bootstrap%E7%9A%84JS%E5%85%83%E4%BB%B6/"},{"title":"部落格導入流量的一些想法記錄：平台和搜尋的不同","text":"最近在研究部落格經營。一方面是我自己也想寫，另一面正也和我準備投入的前端領域息息相關。多少了解一些，對工作多少應該會有些幫助吧！就算沒有幫助，對跟不同領域的人聊天應該也會有幫助（笑）。 我一直以為經營部落格就是好好寫文章，可是現在因為競爭非常激烈（畢竟入手低嘛），經營部落格已經不單單是認真寫文章而已了。認真寫文章、有好的文章品質、圖片品質，這都是部落客的基本條件而已，更重要的是部落格要怎麼「導入流量」。導入流量有幾個方法：社群平台、文章平台、google 搜尋（也就是大家常常在說的 SEO ）。 透過平台來的人依我目前的理解，透過其他社群或其他媒體平台（像是窩客島、PopDaily），透過這些平台導入的流量通常是比較短期的。因為部落格在這些平台上發表文章，其實也只是爭取短期的曝光率。就像是街上的傳單或是大型廣告看板一樣，把資訊丟入人群之中，即便受到資訊吸引，而進到店裡，顧客也不太可能因此對這個部落格產生好感，甚至變成鐵粉。人群實在是很有趣，不管是透過實體或是網路的形式，人的行為模式還是大同小異。 Google 搜尋那 google 搜尋呢？ 透過 Google 搜尋而來的，依我自己的習慣，我自己會覺得透過 Google 搜尋而來的人，會比較容易在網站中停留較久的時間。這有點像是我們在圖書館找資料，因為我有個特定的目的，即便我不太確定一個網站的內容是不是符合我的需求，但是我還是會因為我有我想要找的資料，而多看幾篇網站的文章。這點就和因為平台和社群而來的讀者很不一樣。 比較平台來的讀者是想要打發時間，如果他發現這個網站沒什麼有趣的，他很快就會離開。透過搜尋來的讀者，因為有特定的目的，所以即便網站和他的相關性沒這麼高，他也還是會多看幾篇文章。相較起來，搜尋而來的讀者，似乎黏著度會高一些。平台很像是大型的聯誼、派對活動，因為我只想要找樂子，所以對來的人開放度高，但也沒有太高的忠誠度。Google 搜尋則相反。Google 搜尋則像是我們在購買家電一樣，因為我有非常特定的需求和目標，所以對於到手的資訊，我也比較認真地做檢視，也因此我對店家的記憶也會比較深刻。 結論平台和搜尋來的人因為心態不同，對於網站的觀感也會不同，是需要透過不同的方式做操作，會是比較好的做法。(廢話 XD ) 參考：這個網站有相當多的部落格經營知識，有影片也有文章，非常值得好好閱讀！[https://wpbox.tips/](WordPress 架站百寶箱)","link":"/2020/03/03/how-to-get-traffic/"},{"title":"如何加強自己學習的動力？","text":"前陣子撞牆期有點久，過了快半年我才釐清自己的狀態其實是因為找不到確切的方向。突破了這點後，發現自己又有前進的動力了！我想把這段時間的經驗寫下來，希望能幫助到有類似困惑的人。 投入前端學習的這段時間，我發現我時間管理實在很差。不過，我後來意識到這並不是時間管理的問題，是我完全無法投入學習的過程，很容易在一個小章節就馬上分心。這並不是我原本的狀態。在上一份工作中，我可以全心投入工作過程，讓自己可以在十分鐘甚至是五分鐘之內結束一份小任務，這不是因為我時間管理特別好，是因為我把注意力全心全意地投入在工作的過程中。我很喜歡那種感覺。可是，在離職之後，儘管一開始我還是可以保有原本的投入狀態，當時學習的品質也很好。可是，大約過了半年之後，我發現我忽然沒辦法進入那樣的狀態了！ 經過一段時間摸索，我才意識到原來我是找不到更明確的方向。儘管我有成為前端工程師，這樣的目標。但是，我發現這樣的目標對我來說，其實非常模糊，難以想像、捉摸。成為前端工程師，是怎樣的前端工程師呢？只是完成這些課程的作業、多做幾個作品嗎？像這樣的問題一直在我腦海裡出現。我總覺得這樣的目標對我來說還是太模糊。 探索一段時間後，我發現自己需要找出一個有興趣的領域，往那個部分去鑽研，會是個比較有效率的做法。對我而言，有了自己關心的問題，才有辦法踏實地在這個領域前進。去年，本來我對前端領域變得沒什麼興致了。可是，最近因為對部落格經營、wordpress 很有興趣，連帶著連前端這塊，也忽然又有動力往前了。稍微看了別人寫的部落格，慢慢地我才意識到原來我不是因為沒興趣，是因為我想要感受到一些實際工作的真實感。我想要感受看看，實際架站時，會遇到什麼問題。在研究部落格經營時，我發現網路上看見的部落客提出的問題，就是我未來在工作中可能會遇到的問題，那瞬間的真實感，讓我意識到自己可以先往哪些地方定錨，再透過這些錨點往更寬廣的地方鑽研。 這部分有點像是像在念書時，我們會很自然地想要在這個領域裡面，找出自己有興趣的部分，往那個方向鑽研。以我自己而言，我不會因為我對外國文學、小說有興趣，我就狂念「所有」的西方文學作品。我需要的是對這些西方文學有個基本的認識；如果，想要在這個領域更進一步地發展，就必須決定一個方向。這樣學習上才會更有效率。又或者是在經營部落格、YouTube時，會寫文章、會拍影片只是一個基本要求，可是要在這個領域裡更突出，就得找出自己的風格。這部分就跟寫出幾篇文章、拍出幾個影片一點關係也沒有了。因為在其他領域做得太自然了，導致在投入前端這個對我而言相對陌生的領域時，我完全沒有意識到我其實是需要找一個自己最有興趣的方向。 這幾天想通這件事後，雖然進度一樣不快，但心裡卻時踏實很多。在這樣的狀態下，我發現我也比較容易看見自己可以做些什麼，而不是胡亂地抓住各種外界給的目標，讓自己迷失在各種學習裡。","link":"/2020/03/07/%E5%A6%82%E4%BD%95%E5%8A%A0%E5%BC%B7%E8%87%AA%E5%B7%B1%E5%AD%B8%E7%BF%92%E7%9A%84%E5%8B%95%E5%8A%9B/"}],"tags":[{"name":"SEO 經營","slug":"SEO-經營","link":"/tags/SEO-%E7%B6%93%E7%87%9F/"},{"name":"Vue cli","slug":"Vue-cli","link":"/tags/Vue-cli/"},{"name":"w3HexSchool","slug":"w3HexSchool","link":"/tags/w3HexSchool/"},{"name":"部落格經營","slug":"部落格經營","link":"/tags/%E9%83%A8%E8%90%BD%E6%A0%BC%E7%B6%93%E7%87%9F/"},{"name":"學習","slug":"學習","link":"/tags/%E5%AD%B8%E7%BF%92/"}],"categories":[{"name":"部落格","slug":"部落格","link":"/categories/%E9%83%A8%E8%90%BD%E6%A0%BC/"},{"name":"生活紀錄","slug":"生活紀錄","link":"/categories/%E7%94%9F%E6%B4%BB%E7%B4%80%E9%8C%84/"},{"name":"前端技術筆記","slug":"前端技術筆記","link":"/categories/%E5%89%8D%E7%AB%AF%E6%8A%80%E8%A1%93%E7%AD%86%E8%A8%98/"}]}